docker/service/src/integration-test/resources/responses/get_resource_permissions.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns="urn:hl7-org:v3">
    <SOAP-ENV:Header>
        <wsa:MessageID>uuid:6B29FC40-CA47-1067-B31D-00DD010662DA</wsa:MessageID>
        <wsa:Action>urn:nhs:names:services:lrs/SET_RESOURCE_PERMISSIONS_INUK01</wsa:Action>
        <wsa:To>https://synch.nis1.national.ncrs.nhs.uk/syncservice/tms</wsa:To>
        <wsa:From>
            <wsa:Address>http://myMSH.com/pds/myPage.asmx</wsa:Address>
        </wsa:From>
        <communicationFunctionRcv>
            <device>
                <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ999-100000000900001"/>
            </device>
        </communicationFunctionRcv>
        <communicationFunctionSnd>
            <device>
                <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ000-100000000800001"/>
            </device>
        </communicationFunctionSnd>
        <wsa:ReplyTo>
            <wsa:Address>http://myMSH.com/pds/myPage.asmx</wsa:Address>
        </wsa:ReplyTo>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <GET_RESOURCE_PERMISSIONS_INUK01 xmlns="urn:hl7-org:v3" xmlns:crs="http://national.carerecords.nhs.uk/schema/crs/" type="Message">
            <id root="11111111-1111-1111-1111-111111111111"/>
            <creationTime value="200401061130"/>
            <versionCode code="V3NPfIT3.0"/>
            <interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="SET_RESOURCE_PERMISSIONS_INUK01"/>
            <processingCode code="P"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="NE"/>
            <communicationFunctionRcv type="CommunicationFunction" typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE" type="Device">
                    <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ999-100000000900001"/>
                </device>
            </communicationFunctionRcv>
            <communicationFunctionSnd type="CommunicationFunction" typeCode="SND">
                <device type="Device" classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.826.0.1285.0.2.0.107" extension="ZZZ000-100000000800001"/>
                </device>
            </communicationFunctionSnd>
            <ControlActEvent classCode="CACT" moodCode="EVN">
                <author typeCode="AUT">
                    <AgentPersonSDS classCode="AGNT">
                        <id root="1.2.826.0.1285.0.2.0.67" extension="7643324387"/>
                        <agentPersonSDS classCode="PSN" determinerCode="INSTANCE">
                            <id root="1.2.826.0.1285.0.2.0.65" extension="5452322"/>
                        </agentPersonSDS>
                        <part typeCode="PART">
                            <partSDSRole classCode="ROL">
                                <id root="1.2.826.0.1285.0.2.1.104" extension="ABCD"/>
                            </partSDSRole>
                        </part>
                    </AgentPersonSDS>
                </author>
                <author1 typeCode="AUT">
                    <AgentSystemSDS classCode="AGNT">
                        <agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
                            <id root="1.2.826.0.1285.0.2.0.107" extension="accredited system id"/>
                        </agentSystemSDS>
                    </AgentSystemSDS>
                </author1>
                <author1 typeCode="AUT">
                    <AgentSystemSDS classCode="AGNT">
                        <agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
                            <id root="9.99.999.9.999999.9.9.9.9.9.99" extension="workstation id"/>
                        </agentSystemSDS>
                    </AgentSystemSDS>
                </author1>
                <crs:getResourcePermissionsResponse xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://national.carerecords.nhs.uk/schema/crs/">
                    <crs:permissions>
                        <crs:resourceContext root="2.16.840.1.113883.2.1.4.1" extension="9999999484"/>
                        <crs:accessControlAssertion>
                            <crs:permission>Yes</crs:permission>
                            <crs:userData/>
                            <crs:resource>
                                <crs:type>SCR</crs:type>
                                <crs:Id>SomeResourceId1</crs:Id>
                            </crs:resource>
                            <crs:function>
                                <crs:context>Consent</crs:context>
                                <crs:code>SomeFunctionCode1</crs:code>
                            </crs:function>
                            <crs:accessor>
                                <crs:type>Everyone</crs:type>
                                <crs:accessorId>
                                    <crs:id>SomeAccessorId1</crs:id>
                                    <crs:name>SomeAccessorName1</crs:name>
                                </crs:accessorId>
                            </crs:accessor>
                        </crs:accessControlAssertion>
                        <crs:accessControlAssertion>
                            <crs:permission>No</crs:permission>
                            <crs:userData/>
                            <crs:resource>
                                <crs:type>SCR</crs:type>
                                <crs:Id>SomeResourceId2</crs:Id>
                            </crs:resource>
                            <crs:function>
                                <crs:context>Consent</crs:context>
                                <crs:code>SomeFunctionCode2</crs:code>
                            </crs:function>
                            <crs:accessor>
                                <crs:type>User Id</crs:type>
                                <crs:accessorId>
                                    <crs:id>SomeAccessorId2</crs:id>
                                    <crs:name>SomeAccessorName2</crs:name>
                                </crs:accessorId>
                            </crs:accessor>
                        </crs:accessControlAssertion>
                    </crs:permissions>
                </crs:getResourcePermissionsResponse>
            </ControlActEvent>
        </GET_RESOURCE_PERMISSIONS_INUK01>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
